//=============================================================================
//
// ブロック生成
// Author:arita meigen
//
//=============================================================================
#ifndef _AREA_H_		// このマクロ定義がされてなかったら
#define _AREA_H_		// 二重インクルード防止のマクロ定義

//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include"Object.h"

//-----------------------------------------------------------------------------
// 前方宣言
//-----------------------------------------------------------------------------
class CPlayer;
class CItem;

//=============================================================================
// 構造体定義
//=============================================================================
class CArea : public CObject
{
public:
	explicit CArea(int nPriority = 2);
	~CArea();
	HRESULT Init();
	void Uninit();
	void Update();
	void Draw();
	static CArea *Create(D3DXVECTOR2 index, const unsigned int inRangel,const unsigned int inTime);

private:
	//メンバ変数
	D3DXVECTOR2 m_centerIndex;	// 中心のブロック番号
	unsigned int m_rangel;		// 範囲
	unsigned int m_time;		// 時間
};

#endif
