//======================================================
//
// item_bom.cpp
// Author : 髙野馨將
//
//======================================================
#include "Item_Bom.h"
#include "Texture.h"

//======================================================
//コンストラクタ
//======================================================
CBom::CBom(int nPriority) : CItem(nPriority)
{
}

//======================================================
//デストラクタ
//======================================================
CBom::~CBom()
{
}

//======================================================
//初期化処理
//======================================================
HRESULT CBom::Init(void)
{
	//初期化
	CItem::Init();

	//テクスチャ設定
	SetTextureKey("SPEED_UP_ITEM_ICON");

	return S_OK;
}

//======================================================
//終了処理
//======================================================
void CBom::Uninit(void)
{
	//終了
	CObject3D::Uninit();
}

//======================================================
//更新処理
//======================================================
void CBom::Update(void)
{
	//更新
	CItem::Update();
}

//======================================================
//生成処理
//======================================================
CBom *CBom::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size, const D3DXVECTOR3 rot, const int nLife)
{
	//動的確保
	CBom *pBom = new CBom;

	if (pBom != nullptr)
	{
		//情報の設定
		pBom->Init();
		pBom->SetPos(pos);
		pBom->SetSizePlan(size);
		pBom->SetRot(rot);
		pBom->SetLife(nLife);
		pBom->SetEffect(BOM);
	}

	return pBom;
}

//======================================================
//投擲処理
//======================================================
void CBom::Explosion(void)
{
	
}